

# 寫一個打印菜單的函數
def show_menu():
    print('+--------------------------------+')
    print('|  1) 添加學生信息               |')
    print('|  2) 查看所有學生信息           |')
    print('|  3) 修改學生的成績             |')
    print('|  4) 刪除學生信息               |')
    print('|  5) 按成績從高至低打印學生信息 |')
    print('|  6) 按成績從低至高打印學生信息 |')
    print('|  7) 按年齡從大到小打印學生信息 |')
    print('|  8) 按年齡從小到大打印學生信息 |')
    print('|  9) 保存信息到文件(si.txt)     |')
    print('|  10)從文件中读取数据(si.txt)   |')
    print('|  q) 退出                       |')
    print('+--------------------------------+')

